Repository: solbu/hldig
Catalog: po/*.po
Languages: ru

source: Tells hldig to append .work to database files, causing a second copy of the database to be built. This allows the original files to be used by hlsearch during the indexing run.
ru: hldig добавит .work к файлам базы данных, что приведет к загрузке второй базы данных. Это позволит hlsearch использовать оригинальные файлы при прогоне индексов.

source: -a Use alternate work files.
ru: -a Использовать альтернативные рабочие файлы.

source: -c configfile Use the specified configuration file instead of the default.
ru: -c configfile Использовать указанные настройки файла вместо настроек по умолчанию.

source: -h hop count Limit the stored documents to those which are at most hopcount links away from the start URL.
ru: -h hop count Ограничить количество сохраненных файлов до тех которые отдалены на самое большое количество хопов от начала URL.

source: -i Initial. Do not use any old databases. This is accomplished by first erasing the databases.
ru: -i Начало. Не используйте старые базы данных. Это будет достигнуто при первом удалении баз данных.

source: -m minimalfile (or just a file name at end of arguments) Tells hldig to read URLs from the supplied file and index them in place of (or in addition to) the existing URLs in the database and the start_url. With the -m, only the URLs specified are added to the database. A file name of '-' indicates the standard input.
ru: -m minimalfile (или просто имя файлов в конце аргументов) hldig будет читать URLs с предоставленного файла и индекса вместо (или в придачу к) существующим URLs в базе данных и start_url. С -m, только указанные URLs будут добавлены в базу данных. А название файла '-' определит стандартный ввод.

source: -s Report statistics after completion.
ru: -s Сообщить результаты после завершения.

source: -t Create an ASCII version of the document database. This database is easy to parse with other programs so that information can be extracted from it.
ru: -t Создать ASCII версию базы данных, которая содержит документы. Эту базу данных будет проще анализировать в других программах так что эта информация будет извлечена из базы данных.

source: -u username:password Tells hldig to send the supplied username and password with each HTTP request. The credentials will be encoded using the 'Basic' authentication scheme. There *HAS* to be a colon (:) between the username and password.
ru: -u username:password hldig отправит предоставленные имя пользователя и пароль с каждым HTTP запросом. Учетные данные будут закодированы по схеме аутентификации 'Basic'. Данные *ДОЛЖНЫ* содержать двоеточие (:) между именем пользователя и паролем.

source: -v Verbose mode This increases the verbosity of the program. Using more than 2 is probably only useful for debugging purposes. The default verbose mode gives a nice progress report of what it is doing and where it is.
ru: -v Подробный режим Это увеличит детальность программы. Использовать больше чем 2 будет полезно для отладочных целей. Детальность по умолчанию сгенерирует отчет о ходе работы включая что происходит и где происходит.

source: HEAD call before GET : No
ru: Вызов HEAD перед GET : Нет

source: HEAD call before GET : Yes
ru: Вызов HEAD перед GET : Да

source: Persistent connections : No
ru: Постоянные подключения : Нет

source: Persistent connections : Yes
ru: Постоянные подключения : Да

source: URL:
ru: Ссылка:

source: document
ru: документ

source: is no longer supported
ru: больше не поддерживается

source: query_string A CGI-style query string can be given as a single argument, and is only used if the REQUEST_METHOD environment variable is not set. If no query_string is given, and REQUEST_METHOD is not set, hlsearch will prompt for the query.
ru: query_string Стринг стиля CGI может быть передан как одиночный аргумент, и будет использован только если REQUEST_METHOD переменная среды не обнаружена. Если query_string не указан, и REQUEST_METHOD не обнаружена, hlsearch запросит стринг.

source: seen:
ru: просмотренно:

source: server
ru: сервер

source: '%s' is not a supported algorithm
ru: '%s' не поддерживается алгоритмом

source: : Errors to take note of:
ru: : Обратите внимание на ошибки:

source: : Run complete
ru: : Запуск завершен

source: <h1>hl://Dig error</h1> <p>hlsearch detected an error. Please report this to the webmaster of this site by sending an e-mail to:
ru: <h1>hl://Dig error</h1> <p>hlsearch обнаружил ошибку. Пожалуйста сообщите системному администратору сайта по этому имейлу:

source: Cannot install SIGHUP handler
ru: Невозможно установить SIGHUP

source: Cannot install SIGINT handler
ru: Невозможно установить SIGINT

source: Cannot install SIGPIPE handler
ru: Невозможно установить SIGPIPE

source: Cannot install SIGQUIT handler
ru: Невозможно установить SIGQUIT

source: Cannot install SIGTERM handler
ru: Невозможно установить SIGTERM

source: Could not open argument '%s' of flag -m
ru: Невозможно открыть аргумент '%s' флага -m

source: Database is empty!
ru: База данных - пуста!

source: Date:
ru: Дата:

source: Deleted, marked by user input: ID:
ru: Удалено, обозначено вводом пользователя: ID:

source: Deleted, never retrieved: ID:
ru: Удалено, не полученно: ID:

source: Deleted, no excerpt: ID:
ru: Удалено, не выписано: ID:

source: Deleted, noindex: ID:
ru: Удалено, нет индекса: ID:

source: Deleted, obsolete: ID:
ru: Удалено, устарело: ID:

source: Email:
ru: Имейл:

source: External parser error: can't parse Content-Type "
ru: Ошибка внешнего парсера: невозможно обработать Content-Type "

source: External parser error: expected URL in line
ru: Ошибка внешнего парсера: ожидали URL на строчке

source: External parser error: expected anchor in line
ru: Ошибка внешнего парсера: ожидали anchor на строчке

source: External parser error: expected image URL in line
ru: Ошибка внешнего парсера: ожидали URL изображения на строчке

source: External parser error: expected metadata in line
ru: Ошибка внешнего парсера: ожидали мета дату на строчке

source: External parser error: expected text in line
ru: Ошибка внешнего парсера: ожидали текст на строчке

source: External parser error: expected title in line
ru: Ошибка внешнего парсера: ожидали заголовок на строчке

source: External parser error: expected word in line
ru: Ошибка внешнего парсера: ожидали слово на строчке

source: External parser error: no Content-Type given
ru: Ошибка внешнего парсера: Content-Type не найден

source: External parser error: unknown field in line
ru: Ошибка внешнего парсера: неопознаное поле на строчке

source: External transport error: expected URL in line
ru: Ошибка внешнего транспортера: ожидали URL на строчке

source: External transport error: expected content-length in line
ru: Ошибка внешнего транспортера: ожидали content-length на строчке

source: External transport error: expected content-type in line
ru: Ошибка внешнего транспортера: ожидали content-type на строчке

source: External transport error: expected modification time in line
ru: Ошибка внешнего транспортера: ожидали изменение времени на строчке

source: External transport error: expected status code in line
ru: Ошибка внешнего транспортера: ожидали код статуса на строчке

source: External transport error: expected status reason in line
ru: Ошибка внешнего транспортера: ожидали причину статуса на строчке

source: External transport error: unknown field in line
ru: Ошибка внешнего транспортера: неопознаное поле на строчке

source: From:
ru: От:

source: HTTP statistics
ru: HTTP статистика

source: Importing Cookies input file
ru: Импортируем файл с куками

source: Invalid url_part_aliases or common_url_parts: %s
ru: Неправильные url_part_aliases или common_url_parts: %s

source: Invalid url_rewrite_rules: %s
ru: Неправильные url_rewrite_rules: %s

source: Malformed Date
ru: Неправильная Дата

source: Not found
ru: Не найдено

source: Notification required to
ru: Напоминание должно

source: Options:
ru: Опции:

source: Postamble text:
ru: Текст постамбулы:

source: Preamble text:
ru: Текст преамбулы:

source: Reply-To:
ru: Ответить-Для:

source: Saw a date:
ru: Обнаружили дату:

source: Subject:
ru: Тема:

source: Subject: Web page expiry (
ru: Тема: Истекает срок действия Веб страницы (

source: Supported algorithms:
ru: Поддерживаемые алгоритмы:

source: The error message is:</p>
ru: Сообщение ошибки:</p>

source: This program is part of hl://Dig %s
ru: Эта программа часть - hl://Dig %s

source: To:
ru: Для:

source: URL:
ru: Ссылка:

source: Unable to create URL log file '%s'
ru: Невозможно создать URL файл с логами '%s'

source: Unable to create images file '%s'
ru: Невозможно создать файл с изображениями '%s'

source: Unable to find configuration file '%s'
ru: Невозможно найти файл с настройками '%s'

source: Unable to load cookies file '%s' in memory
ru: Невозможно загрузить куки файл '%s' в память

source: Unable to open document database '%s'
ru: Невозможно открыть базу данных с документами '%s'

source: Unable to open document excerpts '%s'
ru: Невозможно открыть документ выдержки '%s'

source: Unable to open document index '%s'
ru: Невозможно открыть документ индекс '%s'

source: Unable to open word database %s
ru: Невозможно открыть базу данных со словами %s

source: Unable to open/create document database '%s'
ru: Невозможно открыть/создать базу данных с документами '%s'

source: Unable to read configuration file
ru: Невозможно прочитать файл с настройками

source: Unable to read document database file '%s' Did you run hldig?
ru: Невозможно прочитать файл базы данных с документами '%s' Вы запускали hldig?

source: Unable to read document excerpts '%s' Did you run hldig?
ru: Невозможно прочитать документ выдержки '%s' Вы запускали hldig?

source: Unable to read document index file '%s' Did you run hldig?
ru: Невозможно прочитать документ индекс файл '%s' Вы запускали hldig?

source: Unable to read template file '%s' Does it exist?
ru: Невозможно прочитать файл формы '%s' Он существует?

source: Unable to read word database file '%s' Did you run hldig?
ru: Невозможно прочитать базу данных слов '%s' Вы запускали hldig?

source: Unknown host or unable to contact server
ru: Неизвестный host или невозможно подключиться к серверу

source: Unknown host or unable to contact server (port)
ru: Неизвестный host или невозможно подключиться к серверу (порт)

source: Warning: Configuration option
ru: Предупреждение: Опция настройки

source: Warning: Import failed! (
ru: Предупреждение: Импорт безуспешен! (

source: Warning: unknown locale!
ru: Предупреждение: неизвестный locale!

source: authorization
ru: авторизация

source: boolean_keywords attribute should have three entries
ru: boolean_keywords атрибут должен содержать три ввода

source: hldig End Time:
ru: hldig Время Окончания:

source: hldig Start Time:
ru: hldig Время начала:

source: hlfuzzy: Could not create database for algorithm:
ru: hlfuzzy: Не удалось создать базу данных для алгоритма:

source: hlfuzzy: Done.
ru: hlfuzzy: Завершено.

source: hlfuzzy: No algorithms specified
ru: hlfuzzy: Алгоритмы не указаны

source: hlfuzzy: Selected algorithm:
ru: hlfuzzy: Выбраный алгоритм:

source: hlfuzzy: Writing index files...
ru: hlfuzzy: Пишем индекс файлы...

source: hlfuzzy: total words:
ru: hlfuzzy: общее количество слов:

source: hlstat: Total documents:
ru: hlstat: Общее количество документов:

source: hlstat: Total unique words:
ru: hlstat: Общее количество уникальных слов:

source: hlstat: Total words:
ru: hlfuzzy: Общее количество слов:

source: hlstat: URLs in database:
ru: hlstat: URLs в базе данных:

source: page expired
ru: истек срок годности страницы

source: usage:
ru: использовать:
